{"layout":{"align":"left"},"home":{"src":"<!--  \n<center>\n    <a id=\"maintext\" href=\"http://jianopt.com/dokhlab/actions/image.php?name=dg2010S.jpg\"\n      rel=\"lytebox\" title=\"Dokholyan Group 2014\">\n      <img src=\"http://jianopt.com/dokhlab/actions/image.php?name=dg2010S.jpg\"\n        border=\"0\">\n    </a>\n  </center>\n-->\n\n<div style=\"line-height:1.3;text-align:justify\">\n  <font size=\"2.5\">\n    <p>\n      <font size=\"4\">W</font>e are a translational systems research group in\n      the\n      <a style=\"color:black\" href=\"https://med.psu.edu/pharmacology\" target=\"_blank\">Pharmacology</a>\n      at the <a style=\"color:black\" href=\"https://www.med.psu.edu/\" target=\"_blank\">Penn\n        State College of Medicine</a>.\n    </p>\n\n    <font size=\"4\">O</font>ur laboratory focuses on understanding etiologies\n    of human diseases, such as cystic fibrosis (CF), amyotrophic lateral\n    sclerosis (ALS), and pain conditions, such as hyperalgesia. We have\n    utilized several integrated computational and experimental strategies to\n    <i>understand, sense (recognize and report), and control</i> aberrant\n    biological molecules, and uncover etiologies of human diseases. We have\n    developed approaches to molecular structural modeling and dynamic\n    simulations, allowing study of structure and dynamics of biological\n    molecules at time scales relevant to biological systems. These approaches\n    uniquely integrate rapid physical dynamics simulations, experiments, and\n    molecular modeling and design, allowing us to make significant\n    breakthroughs in understanding etiologies of CF and ALS. Such integration\n    allows us to perform translational research: from understanding molecular\n    players at atomic level to probing their function at the cellular and\n    organism level, as well as discovering molecular therapeutic strategies\n    to affect these players.\n    <br>\n    <div style=\"width:80px; font-family: Geneva, arial, sans-serif; font-size: 12px;position:relative; margin: 5px 0px 0px 676px;\">\n      <a style=\"color:black\" href=\"#/research\">Read More...</a>\n    </div>\n\n  </font>\n</div>","edit":"https://docs.google.com/document/d/1WL6GRH2OBj3FhWbj7UyE5OFY2r4OpM31gza2059HTxI/edit?usp=sharing"},"research":{"src":"<div class=\"contentdiv\" style=\"width: 785px;\">\n  <div style=\"font:13px Geneva,arial,helvetica,sans-serif\">\n    <p align=\"justify\">\n      <font size=\"4\"><bold>M</bold></font>olecular structure and dynamics underly all biological processes.\n      Most research in biomedical fields\n      is directly or indirectly associated with molecular behavior. In the\n      field of biochemistry, experimental approaches have been directly\n      targeting these molecular properties, albeit within a specific “window”\n      of observable length and time scales. Computational approaches can offer\n      much wider windows, but present only hypotheses about the system rather\n      than “real” observables. Integrated computational and experimental\n      approaches, therefore, present unparalleled strategies for exploring\n      biological systems, a philosophy that has guided us in my laboratory.\n    </p>\n    <p align=\"justify\">\n      <font size=\"4\"><bold>P</bold></font>erhaps the most outstanding challenge in computational biology is\n      sampling of molecular conformational states. Most research in our\n      laboratory has been dedicated to solving this critical problem. We have\n      been pursuing this goal by developing rapid discrete molecular dynamics\n      simulations, novel and unique in the level of accuracy molecular docking\n      algorithm that we have already used to find novel lead compounds to treat\n      CF and reduce chronic and acute pain (in both cases these compounds are\n      been pursued by biotech companies). We are currently pursuing\n      understanding of other human diseases and developing novel pharmaceutical\n      strategies to combat them, and actually searching for compounds using a\n      combination of virtual drug screening and experiment. Application of\n      these tools also allows rational design of proteins that can control\n      other proteins in living cells and organisms. These tools are becoming\n      invaluable resources that enable decoupling cellular networks, as well\n      understanding the impact of a specific protein on the phenotype of an\n      organism. Below, we describe ongoing projects in the lab.\n    </p>\n  </div>\n  <div style=\"text-align: justify; text-justify: inter-word;background: #EEEEEE; border: 1px solid #BBBBBB; font-size: 13px; font-family: Geneva, arial, helvetica, sans-serif;\">\n    <div style=\"margin:10px;padding:10px;text-align:justify;text-justify: inter-word;background: #EEEEEE; border: 1px solid #BBBBBB; font-size: 13px; font-family: Geneva, arial, helvetica, sans-serif;\">\n      <h2>METHODOLOGIES</h2>\n\n      <img src=\"http://jianopt.com/dokhlab/actions/image.php?name=collapse.gif\"\n        id=\"imgtopic1\" style=\"cursor:pointer;\" onclick=\"var style=document.getElementById('divtopic1').style;style.display=(style.display=='block'?'none':'block')\"\n        border=\"0\"> <strong>Molecular\n        Modeling and Simulations</strong><br>\n      <div id=\"divtopic1\" style=\"margin: 5px; padding: 5px 10px 5px 10px; height=800px; width=750px; border: 1px solid #BBBBBB; display: none; overflow: hidden; visibility: visible\">\n        <div>\n          <p align=\"justify\">\n            Many biological processes occur at time scales not\n            accessible to traditional simulation approaches.\n            To reach biologically-relevant time scales, simplified\n            (coarse-grained) models of macromolecules\n            have been developed, in which groups of atoms are replaced by\n            effective atoms (beads),\n            thereby reducing the number of degrees of freedom. We have\n            developed one of the first\n            simplified protein models for a rapid simulation approach known as\n            Discrete Molecular Dynamics (DMD).\n            Unlike molecular mechanics simulations driven by physical forces,\n            DMD simulations are driven\n            by collision events (between atoms/beads). The DMD algorithm gains\n            efficiency over\n            traditional molecular dynamics (MD) because of two characteristics:\n            on average a larger\n            time step and a faster searching/updating algorithm. Therefore, DMD\n            permits rapid and\n            accurate sampling of the conformational space of proteins and\n            protein complexes and is\n            known for its rapid performance in simulating polymer fluids,\n            single homopolymers, proteins,\n            protein aggregates, and gases and liquids.\n          </p>\n          <p align=\"justify\">\n            We have developed a multiscale simulation engine\n            that integrates a variety of simplified\n            models to span time scales ranging between sub-nanoseconds\n            (side-chain motions) and hours (protein aggregation).\n            For reaching sub-nanosecond time scales, we coupled DMD to quantum\n            mechanical simulations. Such coupling allows\n            studies of complex phenomena like the influence of protein dynamics\n            on its enzymatic activity. Key steps to\n            integration are methodologies for transferring between\n            coarse-grained and all-atom models, which are often highly\n            non-trivial since a unique solution to a specific transformation\n            may not exist.\n          </p>\n\n          <div style=\"margin:10px;float:right\">\n            <a href=\"http://jianopt.com/dokhlab/actions/image.php?name=REX-DMD.reduced.jpg\"\n              class=\"lytebox\" data-title=\"<bold>Figure 1. Ab initio folding using DMD simulations</bold>. Superposition of the lowest energy\n              structures derived from <bold><italic>ab initio</italic> folding</bold> DMD simulations of vilin headpiece, WW\n              domain, ACBP, ubiquitin, &amp;lamda;-repressor and villin 14T with crystal structures (grey) of these proteins. We\n              observe multiple refolding events of villin headpiece and WW domain in equilibrium simulations, thus allowing us to\n              determine their folding rates.\">\n              <img style=\"border: 1px #AAAAAA; padding: 3px 3px 3px 3px;\" src=\"http://jianopt.com/dokhlab/actions/image.php?name=REX-DMD.2.jpg\"\n                alt=\"Figure 1\" width=\"492px\" height=\"193px\">\n            </a>\n            <div align=\"center\">\n              <strong>Figure 1.</strong> Ab initio folding using DMD simulations.\n            </div>\n          </div>\n\n          <p align=\"justify\">\n            To reach biologically-relevant time scales not reachable by\n            traditional simulation approaches,\n            we developed molecular models for the rapid simulation approach,\n            Discrete Molecular Dynamics (DMD).\n            These models differ by the accessible time scales. Despite their\n            simplicity, these models have\n            strikingly predictive power as shown by our recent studies. We\n            built a web-based platform,\n            iFold (<a href=\"http://ifold.dokhlab.org\">http://ifold.dokhlab.org</a>),\n            for performing DMD\n            protein simulations. iFold is the first molecular dynamics engine\n            available via web interface.\n            To perform protein design and structure prediction, we developed a\n            protein modeling suite,\n            MEDUSA, that can account for conformational rearrangements during\n            design. Using MEDUSA,\n            we developed a methodology, Eris (<a href=\"http://eris.dokhlab.org\">http://eris.dokhlab.org</a>),\n            to efficiently and accurately compute the stability changes of\n            proteins upon mutations.</p>\n        </div>\n      </div>\n\n      <img src=\"http://jianopt.com/dokhlab/actions/image.php?name=collapse.gif\"\n        id=\"imgtopic2\" style=\"cursor:pointer;\" onclick=\"var style=document.getElementById('divtopic2').style;style.display=(style.display=='block'?'none':'block')\"\n        border=\"0\"> <strong>Drug Discovery</strong><br>\n      <div id=\"divtopic2\" style=\"margin: 5px; padding: 5px 10px 5px 10px; width=750px; border: 1px solid #BBBBBB; display: none; overflow: hidden; visibility: visible\">\n        <div>\n          <p align=\"justify\">\n            Uncovering structures of molecular complexes via computational\n            docking is at the heart of virtual drug screening and many\n            structural modeling efforts. Modeling both receptor and ligand\n            flexibility is important in order to\n            capture conformation changes induced by ligand binding, but is a\n            major challenge in computational drug discovery.\n            This challenge stems from the vast conformational space sampled by\n            both ligand and receptor and by their\n            relative positioning: upon ligand binding, the system loses\n            translational entropy and a significant\n            number of configurations (configurational entropy) of the ligand,\n            which depends strongly on its number\n            of degrees of freedom (e.g. the number of rotatable bonds). The\n            complexity of configurational entropy\n            calculation requires an approach that incorporates both receptor\n            and ligand flexibility in a computationally efficient manner.</p>\n\n          <div style=\"float:right;margin:10px\">\n            <a href=\"http://jianopt.com/dokhlab/actions/image.php?name=Drug-figure.reduced.jpg\" class=\"lytebox\" data-title=\"<bold>Figure 2. Molecular docking.</bold> Comparison between the lowest\n              energy structures of (A) drug (purple) and (B) peptide, overlaid with the\n              snapshots of crystal structures of corresponding moieties (grey and black\n              respectively). (C) and (D) illustrate how significantly the same protein binding\n              pocket changes upon binding of different drugs.\">\n              <img style=\"border: 1px #AAAAAA; padding: 3px 3px 3px 3px;\" src=\"http://jianopt.com/dokhlab/actions/image.php?name=Drug-figure.2.jpg\"\n                alt=\"Figure 2\" width=\"329px\" height=\"278px\">\n            </a>\n            <div align=\"center\">\n              <strong>Figure 2.</strong> Small Ligand and peptide docking.\n            </div>\n          </div>\n\n          <p align=\"justify\">\n            <italic>Small molecule docking.</italic> Existing flexible docking\n            approaches\n            model ligand and receptor flexibilities either separately or in a\n            loosely-coupled\n            manner, which captures the conformational changes inefficiently.\n            The principal\n            limitation is that no current docking algorithm directly models the\n            “induced fit” phenomenon, whereby both ligand and receptor\n            undergo synergistic conformational changes. We have developed a\n            truly\n            flexible docking approach, MedusaDock, which models both ligand and\n            receptor flexibilities simultaneously and synergistically (Figure\n            2),\n            is distinct from ensemble-docking algorithms, which perform rigid\n            docking of ensembles of separately generated ligand and target\n            conformations. MedusaDock benchmarks demonstrate rapid sampling\n            efficiency and high prediction accuracy in both self-docking (to\n            the\n            co-crystallized state) and cross-docking (to a state crystallized\n            with a different ligand), the latter of which mimics the virtual\n            screening procedure in computational drug discovery. We also\n            demonstrated remarkable performance in the recent\n            Community Structural-Activity Resources (CSAR) docking competition,\n            showing in a blind test the ability to predict binding site and\n            pose (root-mean-square distance &lt; 2.5Å) of drugs in 80% of test\n            cases.\n          </p>\n          <p align=\"justify\">\n            The high predictive power of MedusaDock comes from several\n            innovations,\n            including generation of a stochastic rotamer library of ligands, an\n            efficient docking\n            protocol, and a novel ligand pose-ranking method. We expect broad\n            adaption of these\n            novel methodologies and application of MedusaDock in\n            ligand-receptor interaction\n            predictions and drug discovery. My laboratory has successfully used\n            MedusaDock for\n            virtual drug screening for two targets: cystic fibrosis\n            transmembrane conductance\n            regulator (CFTR) and μ-opioid receptor. In both cases, we\n            identified and experimentally\n            validated leads that are now under further optimization in a\n            commercial setting.\n            Currently, we are engaged in several virtual screening projects by\n            utilizing MedusaDock.\n          </p>\n          <p align=\"justify\">\n            <italic>Peptide docking.</italic> Understanding molecular\n            mechanisms of protein-peptide\n            recognition is vital for predicting and designing novel\n            protein-peptide interactions,\n            and applicable to systems in biology, medicine, and pharmaceutical\n            sciences.\n            Modeling protein-peptide associations is challenging due to many\n            peptide\n            degrees of freedom, ill-defined boundaries of the peptide-binding\n            site,\n            and “induced fit” conformational changes of protein and peptide\n            upon binding. Prediction of binding sites and poses of peptides has\n            been one\n            of the most outstanding problems in computational structural\n            biology. Until\n            recently, no single method simultaneously predicted the binding\n            pocket on the\n            protein surface and the experimental pose of the peptide using\n            <italic>only the unbound conformation of the protein and the sequence ofthe\n              peptide</italic>. We recently proposed a DMD-based approach that\n            allows\n            direct observation of atomistic details of protein-peptide\n            interactions.\n            Using our new method, we revealed the critical contribution of\n            electrostatics and\n            conformational flexibility in peptide recognition.\n          </p>\n          <p align=\"justify\">\n            We are now extending our peptide docking methodology to develop\n            peptide-based\n            sensors, such as a recently designed dye-conjugated peptide that\n            senses\n            cysteine-rich intestinal protein (CRIP1), overexpressed in 90% of\n            breast\n            cancers. Among several other targets we pursue are competitive\n            inhibitors\n            of the ricin A-chain, a potential bioterrorism threat.</p>\n        </div>\n      </div>\n\n      <img src=\"http://jianopt.com/dokhlab/actions/image.php?name=collapse.gif\"\n        id=\"imgtopic3\" style=\"cursor:pointer;\" onclick=\"var style=document.getElementById('divtopic3').style;style.display=(style.display=='block'?'none':'block')\"\n        border=\"0\"> <strong>Protein Design of\n        Tools for Sensing and Controlling Proteins</strong><br>\n      <div id=\"divtopic3\" style=\"margin: 5px; padding: 5px 10px 5px 10px; width=750px; border: 1px solid #BBBBBB; display: none; overflow: hidden; visibility: visible\">\n        <div>\n          <p align=\"justify\">Mutagenesis is a valuable exploratory tool in\n            molecular biology and biotechnology.\n            To what extent mutations affect thermodynamic stability and\n            structure of proteins\n            is often vital to experimental design. Estimations of protein\n            stability remain\n            challenging in computational molecular biology. We developed novel\n            methodology,\n            Eris, for accurately predicting mutation-induced protein stability\n            changes. The\n            distinguishing innovation allowing Eris to outperform most\n            computational techniques\n            is the physical force-field combined with fast\n            conformation-sampling algorithm. Since\n            our introduction of the web-platform (<a href=\"http://eris.dokhlab.org\">http://eris.dokhlab.org</a>)\n            to the community, we have had &gt;1,400 subscribers performing\n            &gt;20,000 jobs. Eris,\n            combined with a search algorithm for a sequence with targeted\n            stability, allows\n            protein design, designing mutations that modulate protein\n            stability, and peptides\n            that bind to a protein. Perhaps the most challenging design we have\n            performed was\n            of a novel unstructured protein, <italic>uniRapR</italic>, that\n            transitions to\n            distinct structure upon binding of rapamycin. We delineated the\n            allosteric pathway\n            to the active site of kinases, and used <italic>uniRapR</italic> to\n            control kinases\n            with rapamycin. Without rapamycin, <italic>uniRapR</italic>\n            allosterically destabilizes\n            the active site, inactivating the kinase (Figure 3). Upon addition\n            of rapamycin,\n            <italic>uniRapR</italic> gains structure and stabilizes the active\n            site,\n            activating the kinase. We demonstrated this methodology in living\n            cells and\n            in zebrafish, and showed its transferability to various kinases.\n            This successful\n            design was possible because we combined DMD simulations with\n            protein design.</p>\n          <div style=\"float:right;margin:10px\">\n            <a href=\"http://jianopt.com/dokhlab/actions/image.php?name=Rapamycin_fig.reduced.jpg\"\n              class=\"lytebox\" data-title=\"<bold>Figure 3.Control of Src activity with uniRapR domain.</bold> \n              <bold>a)</bold>Schematic representation of activity control with a uniRapR domain. b) Root mean square \n              fluctuations of an ATP binding site (gray structure) based on multiple equilibrium DMD \n              simulations for wild type Src (black), apo (red), and holo (green) uniRapR attached Src. \n              c) Src-uniRapR-cerulean-myc construct was expressed in HEK293T cells that were treated with \n              different concentrations of rapamycin (0 to 2μM), lysed and blotted with anti-GFP to confirm \n              the expression of the construct. The construct was precipitated with anti-myc and mixed with \n              substrate paxilin and ATP for 10 minutes. The reaction was blotted with anti-myc to confirm the\n              binding, with anti pY31-paxilin to confirm phosphorylation of the substrate. d) To compare with \n              the controls, constitutively active (YF) without uniRapR domain, kinase dead(KD), Y271A and L1polyP \n              mutants with uniRapR domain, and our previous dimerization-based switch are used. e) Y271 \n              and L1 mutations are shown on Src-uniRapR model.\">\n              <img style=\"border: 1px #AAAAAA; padding: 3px 3px 3px 3px;\" src=\"http://jianopt.com/dokhlab/actions/image.php?name=Rapamycin_fig.2.jpg\"\n                alt=\"Figure 3\" width=\"710px\" height=\"258px\">\n            </a>\n            <div align=\"center\">\n              <strong>Figure 3.</strong> Control of Src activity with uniRapR\n              domain.\n            </div>\n          </div>\n                  \n          <div style=\"float:right;margin:10px\">\n            <a href=\"http://jianopt.com/dokhlab/actions/image.php?name=Allosteric.jpg\"\n              class=\"lytebox\" data-title=\"<bold>Figure 3.Scheme for allosteric modulation. \n              (A)</bold> A schematic process of allosteric\n              regulation. <bold>(B)</bold> Light \n              or drug regulatable molecular switch. <bold>(C)</bold> and \n              <bold>(D)</bold> In a chosen target protein, \n              allosteric networks are identified and rank ordered using multiple filters \n              (thick and thin green lines). A hot spot for insertion is chosen based on \n              network properties. Depending on the application, inactivation <bold>(C)</bold> or \n              activation <bold>(D)</bold> of the target protein can be controlled.\">\n              <img style=\"border: 1px #AAAAAA; padding: 3px 3px 3px 3px;\" src=\"http://jianopt.com/dokhlab/actions/image.php?name=Allosteric.jpg\"\n                alt=\"Figure 4\" width=\"229px\" height=\"368px\">\n            </a>\n            <div align=\"center\">\n              <strong>Figure 4.</strong>Scheme for allosteric modulation.\n            </div>\n          </div>\n                  \n          <p align=\"justify\">\n            The ability to design proteins whose activities\n            can be controlled with specificity\n            and precise timing has broad implications for the study of protein,\n            cell, and tissue\n            dynamics. Our objective is to develop a widely applicable\n            computational methodology\n            to characterize the allosteric network in a protein and to identify\n            the allosteric\n            regulation hot spots (Figure 4). These identified hot spots can be\n            potentially\n            used in both rational drug design and protein engineering. The\n            applicability of\n            the developed methodology is underscored by the large number of\n            proteins with\n            three-dimensional structures known in one or more functional\n            states. In our\n            laboratory, we will focus on utilizing protein allostery to\n            engineer regulatable\n            proteins using both drug-activatable (RapR) and photo-activatable\n            molecular\n            switches. Allosteric regulation by light allows both spatial and\n            temporal\n            control of protein activity, and will be tremendously valuable for\n            studies\n            of cellular dynamics. The advantage of the drug-activatable\n            molecular switches\n            is their ability to be used in live animal tissues not accessible\n            to light sources.\n            Although drug-mediated activation allows only temporal control of\n            protein activity,\n            a “caged” RapR approach recently developed in collaboration with\n            Drs.\n            Alex Dieters and Klaus Hahn, can add spatial control. This approach\n            relies on a\n            photoactivated rapamycin that is uniquely responsive to the iFKBP\n            we use for Src\n            regulation. Upon successful development of the methodology, we will\n            have means\n            to computationally predict allosteric regulation hot spots in\n            proteins and a set\n            of molecular imaging tools that benefit several fields of research,\n            including\n            cancer, developmental biology, and pharmacology.\n          </p>\n        </div>\n      </div>\n\n      <img src=\"http://jianopt.com/dokhlab/actions/image.php?name=collapse.gif\"\n        id=\"imgtopic4\" style=\"cursor:pointer;\" onclick=\"var style=document.getElementById('divtopic4').style;style.display=(style.display=='block'?'none':'block')\"\n        border=\"0\"> <strong>RNA structure and\n        dynamics</strong><br>\n      <div id=\"divtopic4\" style=\"margin: 5px; padding: 5px 10px 5px 10px; width=750px; border: 1px solid #BBBBBB; display: none; overflow: hidden; visibility: visible\">\n        <div>\n          <div style=\"float:right;margin:10px\">\n            <a href=\"http://jianopt.com/dokhlab/actions/image.php?name=RNA-figure.reduced.jpg\"\n              class=\"lytebox\" data-title=\"<bold>Figure 5. <italic>Ab initio</italic> RNA structure prediction</bold> \n              of (A) CrPV (49 nucleotides; root-mean square distance (RMSD) between the\n              experimental (blue) and predicted (red) structures is 3.6 Å), (B) HHR\n              (67 nucleotides; RMSD=5.4Å),(C)tRNA<sup>Asp</sup> (75 nucleotides;\n              RMSD=6.4Å), and (D) P546 (158 nucleotides; RMSD=11.3Å).\">\n              <img style=\"border: 1px #AAAAAA; padding: 3px 3px 3px 3px;\" src=\"http://jianopt.com/dokhlab/actions/image.php?name=RNA-figure.2.jpg\"\n                alt=\"Figure 5\" width=\"328px\" height=\"162px\">\n            </a>\n            <div align=\"center\">\n              <strong>Figure 5.</strong>\n              <italic> Ab initio</italic> RNA structure prediction.\n            </div>\n          </div>\n                  \n          <p align=\"justify\">\n            RNA molecules are known for their central roles in gene expression,\n            splicing, and translation. However, only ~2% of transcribed RNA are\n            protein-coding in humans, with the remainder fulfilling crucial\n            roles\n            in many cellular processes. RNA function is often achieved via\n            specific\n            ensembles of 3D conformations. Hence, knowledge of underlying 3D\n            structure\n            is often a fundamental prerequisite to completely understanding RNA\n            functions.\n            RNA 3D structure determination remains a paramount challenge in\n            structural\n            biology, with no universal methods to solve their structures. Only\n            a couple\n            hundred structures of small RNA molecules are currently solved,\n            compared to\n            &gt;80,000 protein structures. High-resolution methods such as\n            X-ray crystallography\n            and NMR spectroscopy offer unparalleled atomic-level insight into\n            RNA structure.\n            However, many RNAs are not amenable to structural characterization\n            by these methods\n            because of conformational flexibility or large size. Recently,\n            novel computational\n            methods to determine RNA 3D structure have emerged, but are\n            severely limited with\n            regard to size, typically short fragments of 10-15 nucleotides, due\n            to sampling problems.\n            We have pioneered <italic>ab initio</italic> DMD simulations for\n            determination of RNA\n            structures up to 50 nucleotides. Our iFoldRNA webserver (<a href=\"http://ifold.dokhlab.org\">http://ifold.dokhlab.org</a>)\n            has been used widely since its introduction (~2,000 subscribers\n            worldwide, &gt;20,000 jobs computed).</p>\n          <p align=\"justify\">Perhaps the most daunting problem in 3D structure\n            prediction is RNA flexibility, which requires significant sampling\n            for accurate structure determination. While the DMD algorithm\n            offers a significant advantage in sampling conformation space, we\n            are still limited by computational power and molecular size. One\n            approach to limit conformational space is to use experimental data\n            to bias conformational ensembles toward those observed\n            experimentally. Constraints reduce the entropic contribution to the\n            free energy of the molecular unfolded state, thereby stabilizing\n            the native state(s). Hence, with sufficient number of experimental\n            constraints, we can theoretically obtain accurate RNA structural\n            models. In fact, NMR structure determination is based on these same\n            principles: NOE constraints are determined using NMR, and these\n            constraints are “satisfied” using computational algorithms (e.g.\n            CYANA). Use of DMD with a force-field developed to fold RNA\n            molecules permits use of significantly less number and much more\n            diverse types of constraints. We have made significant effort to\n            utilize various types of experimental constraints to determine 3D\n            structures of large RNA (Figure 3). Our goal is to develop an\n            automated, robust computational protocol for 3D structure\n            determination using various types of experimental constraints and\n            their combinations, and make this protocol widely available via\n            iFoldRNA.</p>\n          <p align=\"justify\">We plan to use the iFoldRNA platform to generate\n            experimentally-testable hypotheses of RNA structure based on\n            sequence and a diverse range of experimental constraints, including\n            NMR and FRET. We have integrated each of these techniques with DMD\n            to build structures of a fluoride riboswitch and free and bound\n            <italic>Tetrahymena</italic> telomerase RNA (manuscripts in\n            preparation). We plan to extend iFoldRNA so that the user will be\n            able to input any type of constraints and the sequence of an RNA\n            molecule, and obtain its 3D structure.</p>\n        </div>\n      </div>\n    </div>\n                  \n    <div style=\"width: 750px; padding: 5px 20px 5px 20px;\">\n      <h2>DISEASE ETIOLOGY</h2>\n      <p align=\"justify\">\n        Protein misfolding is increasingly implicated in many diverse human\n        diseases,\n        including amyotrophic lateral sclerosis (ALS), cystic fibrosis (CF),\n        anemia,\n        phenylketonuria, hyperammonemia, Lesch-Nyhman syndrome, Fabry disease,\n        and others.\n        Protein misfolding results either in loss of function (e.g. in CF) or\n        in toxic\n        gain of function (e.g. in ALS). The fundamental significance of protein\n        misfolding\n        is difficult to over-estimate, yet little is known about molecular\n        mechanisms that\n        result in protein misfolding at the atomic level. Understanding protein\n        misfolding\n        and aggregation will greatly impact modern medicine and biology, and\n        will allow development\n        of novel pharmaceutical strategies.</p>\n      <p align=\"justify\">We use a multidisciplinary approach that uniquely\n        combines biophysics, biochemistry, and structural and computational\n        biology to uncover mechanisms of protein misfolding and aggregation. We\n        then use our knowledge of these mechanisms to uncover etiologies of\n        human disease and develop novel therapeutic strategies. We study a\n        broad range of diseases associated with protein misfolding, but focus\n        on two very distinct ones: ALS and CF, described below.</p>\n\n      <img src=\"http://jianopt.com/dokhlab/actions/image.php?name=collapse.gif\"\n        id=\"imgtopic5\" style=\"cursor:pointer;\" onclick=\"var style=document.getElementById('divtopic5').style;style.display=(style.display=='block'?'none':'block')\"\n        border=\"0\"> <strong>Amyotrophic Lateral Sclerosis</strong><br>\n      <div id=\"divtopic5\" style=\"margin: 5px; padding: 5px 10px 5px 10px; width=750px; border: 1px solid #BBBBBB; display: none; overflow: hidden; visibility: visible\">\n        <div>\n          <div style=\"float:right;margin:10px\">\n            <a href=\"http://jianopt.com/dokhlab/actions/image.php?name=SOD.reduced.jpg\"\n              class=\"lytebox\" data-title=\"<bold>Figure 6. Minial pathway for SDO1 aggregation.</bold> Gluthathionylation \n              promotes SOD1 dissociation.\">\n              <img style=\"border: 1px #AAAAAA; padding: 3px 3px 3px 3px;\" src=\"http://jianopt.com/dokhlab/actions/image.php?name=SOD.2.jpg\"\n                alt=\"Figure 6\" width=\"328px\" height=\"152px\">\n            </a>\n            <div><strong>Figure 6.</strong> Minimal pathway for SOD1\n              aggregation.</div>\n          </div>\n          <p align=\"justify\">\n            The emerging view of processes leading to neuronal death in ALS is\n            that transient\n            oligomeric states of disease-relevant proteins that appear during\n            aggregation are\n            cytotoxic. Specifically, misfolded non-native SOD1, mutations of\n            which are associated\n            with ALS, is found before onset of symptoms in mouse models of the\n            disease and\n            participates in numerous aberrant interactions with cellular\n            components. These\n            aberrant interactions are believed to cause cellular pathologies\n            associated with\n            ALS, such as loss of mitochondrial membrane potential and errors in\n            misfolded\n            protein clearance, supporting a primary role for soluble misfolded\n            SOD1 in ALS\n            pathogenesis. Soluble non-native SOD1 is found in sporadic\n            (non-heritable) ALS\n            patients, suggesting that SOD1 misfolding and aggregation are\n            noxious factors,\n            even in the absence of disease-associated mutations. Blocking\n            surface patches\n            that facilitate formation or deleterious interactions of soluble\n            SOD1 oligomers\n            holds therapeutic potential, but requires detailed structural and\n            mechanistic\n            insight that is not yet available. Our ultimate goal is to\n            determine causes,\n            mechanisms, and consequences of SOD1 misfolding and aggregation in\n            ALS,\n            particularly in the initial stages, while SOD1 is still soluble and\n            therapeutic\n            intervention is more tractable. We have identified a metastable\n            oligomeric\n            state common to both wild type and mutant SOD1. We also found that\n            a physiological\n            oxidative post-translational modification triggers dissociation of\n            wild type\n            and mutant SOD1 dimers, the first step in SOD1 aggregation (Figure\n            6).\n            <italic>We hypothesize that both mutations and oxidative\n              modifications induce\n              structural changes in SOD1 that promote oligomerization and\n              expose surfaces that\n              participate in non-native cellular interactions</italic>. To test\n            this hypothesis,\n            we are currently characterizing structural changes that occur as\n            SOD1 transitions\n            from its native state into soluble, potentially toxic misfolded\n            species. Since the\n            stability of SOD1 dimers plays the most important role in SOD1\n            aggregation, we plan to\n            perform drug screening to identify compounds that stabilize SOD1,\n            for which we are\n            currently developing cellular assays using the neuron cell line\n            NSC-34.</p>\n        </div>\n      </div>\n\n      <img src=\"http://jianopt.com/dokhlab/actions/image.php?name=collapse.gif\"\n        id=\"imgtopic6\" style=\"cursor:pointer;\" onclick=\"var style=document.getElementById('divtopic6').style;style.display=(style.display=='block'?'none':'block')\"\n        border=\"0\"> <strong>Cystic Fibrosis</strong><br>\n      <div id=\"divtopic6\" style=\"margin: 5px; padding: 5px 10px 5px 10px; width=750px; border: 1px solid #BBBBBB; display: none; overflow: hidden; visibility: visible\">\n        <div>\n          <div style=\"float:right;margin:10px\">\n            <a href=\"http://jianopt.com/dokhlab/actions/image.php?name=cftr.reduced.png\"\n              class=\"lytebox\" data-title=\"<bold>Figure 7. Theoretical Model of CFTR structure.</bold> CFTR primary\n              structure containing two nucleotide-binding domains (purple and pink), two membrane-spaning\n              domains (green), and a regulatory region (R domain, grey). Each MSD contatins two\n              cytoplasmic loops (CL).\">\n              <img style=\"border: 1px #AAAAAA; padding: 3px 3px 3px 3px;\" src=\"http://jianopt.com/dokhlab/actions/image.php?name=cftr.2.png\"\n                alt=\"Figure 7\" width=\"328px\" height=\"250px\">\n            </a>\n            <div align=\"center\">\n              <strong>Figure 7.</strong> Theoretical Model of CFTR structure.\n            </div>\n          </div>\n          <p align=\"justify\">\n            Misfolding of CFTR due to deletion of Phe508 (90% of CF cases)\n            results in loss of mature functional CFTR and manifests in abnormal\n            ion and disruption\n            of fluid homeostasis essential for human lung function. Although\n            great progress has\n            been made in understanding the molecular basis of CF, an\n            understanding of the defect\n            in the CFTR ion channel remains a mystery. One of the most\n            significant challenges\n            that hamper our understanding of CFTR is inability to\n            experimentally determine its\n            structure due to structural disorder. We have computationally built\n            the structure of\n            CFTR and validated many of its elements in &gt;30 cysteine\n            crosslinking experiments.\n            We discovered that mutation ΔF508 (Figure 7, red) disrupts\n            interactions between\n            nucleotide-binding domain (NBD1) and the transmembrane region (CL4,\n            blue), thereby\n            destabilizing tertiary structure. To restore critical NBD1:CL4\n            interactions, we\n            performed virtual screening of the ZINC library of drug-like\n            compounds (1.3×10<sup>6</sup> compounds)\n            and identified several potential leads. One in particular,\n            designated I16,\n            shows significant rescue of CFTR-ΔF508 (U.S. Patent Application No.\n            61/636,945 April 23, 2012). </p>\n          <p align=\"justify\">We are further studying allosteric sites for\n            potential drug docking\n            that are expected to have a similar effect to I16. We have\n            previously determined that\n            the regulatory insertion domain (RI) has a pronounced effect on\n            protein stability,\n            and its reengineering fully rescues CFTR. We are planning to\n            perform virtual screening\n            and experimental testing of compounds that stabilize RI.</p>\n          <p align=\"justify\">Our work in the fields of ALS and CF are two main\n            examples\n            of our endeavors. We are also pursuing studies in other areas\n            pertaining to human health.\n            The diverse and unique set of computational and experimental\n            techniques developed in\n            our lab opens up new horizons for understanding and fighting human\n            disease.</p>\n        </div>\n      </div>\n    </div>\n    <div class=\"publist\" style=\"width: 750px; padding: 5px 20px 5px 20px;\">\n      <div class=\"spacer10\"></div>\n      <h2>PROTEIN-BASED THERAPEUTICS AND NANOMEDICINE</h2>\n      <!-- -->\n      <img src=\"http://jianopt.com/dokhlab/actions/image.php?name=collapse.gif\"\n        id=\"imgtopic7\" style=\"cursor:pointer;\" onclick=\"var style=document.getElementById('divtopic7').style;style.display=(style.display=='block'?'none':'block')\"\n        border=\"0\"> <strong>Organophosphate\n        Scavenging</strong><br>\n      <div id=\"divtopic7\" style=\"margin: 5px; padding: 5px 10px 5px 10px; width=750px; border: 1px solid #BBBBBB; display: none; overflow: hidden; visibility: visible\">\n        <div>\n          <p align=\"justify\">Protein-based prophylactic or immediate\n            post-exposure treatments with organophosphate bioscavengers offer\n            significant promise as medical countermeasures for organophosphate\n            toxicity. We are developing both catalytic and non-catalytic\n            bioscavengers to neutralize organophosphate nerve agents.</p>\n        </div>\n      </div>\n\n      <img src=\"http://jianopt.com/dokhlab/actions/image.php?name=collapse.gif\"\n        id=\"imgtopic8\" style=\"cursor:pointer;\" onclick=\"var style=document.getElementById('divtopic8').style;style.display=(style.display=='block'?'none':'block')\"\n        border=\"0\"> <strong>HIV vaccine</strong><br>\n      <div id=\"divtopic8\" style=\"margin: 5px; padding: 5px 10px 5px 10px; width=750px; border: 1px solid #BBBBBB; display: none; overflow: hidden; visibility: visible\">\n        <div>\n          <p align=\"justify\">Despite enormous scientific efforts, development\n            of an effective vaccine for HIV-1 remains a significant challenge.\n            In collaboration with Dr. Ron Swanstrom we use protein engineering\n            to graft epitopes from the HIV viral protein gp120 on to bacterial\n            proteins that would be further used to elicit immunological\n            response to the epitopes in rabbits.</p>\n        </div>\n      </div>\n    </div>\n  </div>\n</div>","edit":"https://docs.google.com/document/d/1gM-XxusLUIsfOWhHmEUQTgeN-yYAw6PViNRpoqHyTjc/edit?usp=sharing"},"tools":{"src":"<div class=\"greybox\" style=\"width: 750px; padding: 5px 20px 5px 20px;\">\n  <!-- Chiron -->\n  <img src=\"http://jianopt.com/dokhlab/actions/image.php?name=collapse.gif\" id=\"imgtopic4\"\n    style=\"cursor:pointer;\" onclick=\"slide_topic4.slideIt();\" border=\"0\">\n  <strong>Chiron</strong>\n  <div id=\"divtopic4\" style=\"margin: 5px; padding: 5px 10px; border: 1px solid rgb(187, 187, 187); display: block; overflow: hidden;\">\n    <div>\n      <p><a href=\"https://dokhlab.med.psu.edu/chiron\" target=\"_blank\"><img\n            style=\"border: 1px dotted #AAAAAA; padding: 3px 3px 3px 3px;\" src=\"http://jianopt.com/dokhlab/actions/image.php?name=Chiron.jpg\"\n            width=\"225\" height=\"150\" align=\"right\"></a>Named after the\n        Thessalian god of healing, Chiron is a server that rapidly minimizes\n        steric clashes in proteins using short discrete molecular dynamics(DMD)\n        simulations. MD or DMD performed under physiological conditions with\n        the structures having high clash energy would result in the protein\n        rapidly unfolding. However, Chiron utilizes a high heat exchange rate\n        of the solute (protein) with the bath in DMD simulations; thus rapidly\n        quenching high velocities arising due to clashes. Using our simulation\n        conditions and the inherent sampling power of DMD, Chiron employs an\n        iterative protocol aimed at minimizing the given protein until it\n        attains an 'acceptable clash score'. Chiron rapidly minimizes clashes\n        while at the same time causing minimal perturbation of the protein\n        backbone. The resulting protein structure has normalized clash score\n        that is comparable to high-resolution protein structures (&lt;2.5 Å).</p>\n    </div>\n  </div>\n\n  <img src=\"http://jianopt.com/dokhlab/actions/image.php?name=collapse.gif\" id=\"imgtopic3\"\n    style=\"cursor:pointer;\" onclick=\"slide_topic3.slideIt();\" border=\"0\">\n  <strong>Eris</strong>\n  <div id=\"divtopic3\" style=\"margin: 5px; padding: 5px 10px; border: 1px solid rgb(187, 187, 187); display: block; overflow: hidden;\">\n    <div>\n      <p><a href=\"https://dokhlab.med.psu.edu/eris\" target=\"_blank\"><img style=\"border: 1px dotted #AAAAAA; padding: 3px 3px 3px 3px;\"\n            src=\"http://jianopt.com/dokhlab/actions/image.php?name=Eris.jpg\"\n            width=\"225\" height=\"150\" align=\"right\"></a>Eris,\n        which takes the name of Greek goddess of discord, is a protein\n        stability prediction server. Eris server calculates the change of the\n        protein stability induced by mutations (ΔΔG) utilizing the recently\n        developed Medusa modeling suite. In our test study, the ΔΔG values of a\n        large dataset (&gt;500) were calculated and compared with the\n        experimental data and significant correlations are found. The\n        correlation coefficients vary from 0.5 to 0.8. Eris also allows\n        refinement of the protein structure when high-resolution structures are\n        not available. Compared with many other stability prediction servers,\n        our method is not specifically trained using protein stability data and\n        should be valid for a wider range of proteins. Furthermore, Eris models\n        backbone flexibility, which turns out to be crucial for ΔΔG estimation\n        of small-to-large mutations. More details are available in our\n        publications:</p>\n      <p>S. Yin, F. Ding, and N. V. Dokholyan, \"Eris: an automated estimator of\n        protein stability\" Nature Methods 4, 466-467 (2007) </p>\n      <p>S. Yin, F. Ding, and N. V. Dokholyan, \"Modeling backbone flexibility\n        improves protein stability estimation\" Structure, 15: 1567-1576 (2007)\n      </p>\n    </div>\n  </div>\n\n  <img src=\"http://jianopt.com/dokhlab/actions/image.php?name=collapse.gif\" id=\"imgtopic8\"\n    style=\"cursor:pointer;\" onclick=\"slide_topic8.slideIt();\" border=\"0\">\n  <strong>SPELL</strong>\n  <div id=\"divtopic8\" style=\"margin: 5px; padding: 5px 10px; border: 1px solid rgb(187, 187, 187); display: block; overflow: hidden;\">\n    <div>\n      <p><a href=\"https://dokhlab.med.psu.edu/spell\" target=\"_blank\"><img style=\"border: 1px dotted #AAAAAA; padding: 3px 3px 3px 3px;\"\n            src=\"http://jianopt.com/dokhlab/actions/image.php?name=SPELL_PIC.jpg\"\n            width=\"225\" height=\"150\" align=\"right\"></a>SPELL\n        (Split Protein rEassembly by Ligand or Light) is a web server for\n        predicting potential split sites in proteins. Reassembly of split\n        protein can be controlled by ligand or light. This is achieved by\n        fusing halves of split protein to two other domains, whose dimerization\n        is controlled by ligand or light.</p>\n      <p>For details of the method, please refer to the paper: Computational\n        design of regulatable split proteins with reduced background activity :\n        Onur Dagliyan, Andrey Krokhotin, Alexander Deiters, Klaus M. Hahn,\n        Nikolay V. Dokholyan (submitted)</p>\n    </div>\n  </div>\n\n  <!--\n  <img src=\"http://jianopt.com/dokhlab/actions/image.php?name=collapse.gif\" id=\"imgtopic1\"\n    style=\"cursor:pointer;\" onclick=\"slide_topic1.slideIt();\" border=\"0\">\n  <strong>iFold</strong>\n  <div id=\"divtopic1\" style=\"margin: 5px; padding: 5px 10px; border: 1px solid rgb(187, 187, 187); display: block; overflow: hidden;\">\n    <div>\n      <p><a href=\"https://dokhlab.med.psu.edu/ifold\" target=\"_blank\"><img style=\"border: 1px dotted #AAAAAA; padding: 3px 3px 3px 3px;\"\n            src=\"http://jianopt.com/dokhlab/actions/image.php?name=iFold.jpg\"\n            width=\"225\" height=\"150\" align=\"right\"></a>iFold\n        is a web portal for interactive protein folding/unfolding simulations.\n        We perform discrete molecular dynamics simulations of proteins using\n        coarse-grained structural models (two-beads/residue).</p>\n      <p>The underlying approach, discrete molecular dynamics, is one of the\n        fastest strategies for simulating protein dynamics, due, in part, to\n        its efficient sampling of the vast conformation space of biomolecules\n        in both length and time scales. iFold server supports simulations for\n        protein folding, unfolding, thermodynamic scan, simulated annealing and\n        p(fold) analysis.</p>\n      <p></p>\n      <p>Currently two-bead/residue Go model is available for protein\n        simulations. Models for DNA and RNA are under development and will be\n        added to iFold in due course. Please use the adjoining menu to\n        register/login to the iFold server. To cite iFold in your research,\n        please use the following reference:</p>\n      <p></p>\n      <p>S. Sharma, F. Ding, H. Nie, D. Watson, A. Unnithan, J. Lopp, D.\n        Pozefsky, and N. V. Dokholyan, \"iFold: A platform for interactive\n        folding simulations of proteins\" Bioinformatics, 22: 2693-2694 (2006).</p>\n    </div>\n  </div>\n-->\n\n  <img src=\"http://jianopt.com/dokhlab/actions/image.php?name=collapse.gif\" id=\"imgtopic2\"\n    style=\"cursor:pointer;\" onclick=\"slide_topic2.slideIt();\" border=\"0\">\n  <strong>iFoldRNA</strong>\n  <div id=\"divtopic2\" style=\"margin: 5px; padding: 5px 10px; border: 1px solid rgb(187, 187, 187); display: block; overflow: hidden;\">\n    <div>\n      <p><a href=\"https://dokhlab.med.psu.edu/ifoldrna\" target=\"_blank\"><img\n            style=\"border: 1px dotted #AAAAAA; padding: 3px 3px 3px 3px;\" src=\"http://jianopt.com/dokhlab/actions/image.php?name=iFoldRNA.jpg\"\n            width=\"225\" height=\"150\" align=\"right\"></a>iFoldRNA is a web portal\n        for interactive RNA folding simulations. We perform discrete molecular\n        dynamics simulations of RNA using coarse-grained structural models\n        (two-beads/residue).</p>\n      <p>To cite iFoldRNA in your research, please use the following\n        references:</p>\n      <p> A. Krokhotin, K. Houlihan, and N. V. Dokholyan, \"iFoldRNA v2: folding\n        RNA with constraints\" Bioinformatics, 31: 2891-2893 (2015).</p>\n      <p>S. Sharma, F. Ding, and N. V. Dokholyan, \"iFoldRNA:Three-dimensional\n        RNA structure prediction and folding\" Bioinformatics, 24: 1951-1952\n        (2008).</p>\n      <p>F. Ding, S. Sharma, P. Chalasani, V. V. Demidov, N. E. Broude, and N.\n        V. Dokholyan, \"Large scale simulations of 3D RNA folding by discrete\n        molecular dynamics: From structure prediction to folding mechanisms\"\n        RNA, 14: 1164-1173 (2008).</p>\n    </div>\n  </div>\n\n\n\n  <img src=\"http://jianopt.com/dokhlab/actions/image.php?name=collapse.gif\" id=\"imgtopic5\"\n    style=\"cursor:pointer;\" onclick=\"slide_topic5.slideIt();\" border=\"0\">\n  <strong>Erebus</strong>\n  <div id=\"divtopic5\" style=\"margin: 5px; padding: 5px 10px; border: 1px solid rgb(187, 187, 187); display: block; overflow: hidden;\">\n    <div>\n      <p><a href=\"https://dokhlab.med.psu.edu/erebus\" target=\"_blank\"><img\n            style=\"border: 1px dotted #AAAAAA; padding: 3px 3px 3px 3px;\" src=\"http://jianopt.com/dokhlab/actions/image.php?name=Erebus.png\"\n            width=\"225\" height=\"150\" align=\"right\"></a>Identifying the location\n        of binding sites on proteins is of fundamental importance for a wide\n        range of applications, including molecular docking, de novo drug\n        design, structure identification, and comparison of functional sites.\n        Here we present Erebus, a web-server that searches the entire Protein\n        Data Bank for a given substructure defined by a set of atoms of\n        interest, such as the binding scaffolds for small molecules. The\n        identified substructure contains atoms having the same names, belonging\n        to same amino acids, and separated by the same distances (within a\n        given tolerance) as the atoms of the query structure. The accuracy of a\n        match is measured by the root-mean-square deviation or by the normal\n        weight with a given variance. Tests show that our approach can reliably\n        locate rigid binding scaffolds of drugs and metal ions.</p>\n    </div>\n  </div>\n\n  <img src=\"http://jianopt.com/dokhlab/actions/image.php?name=collapse.gif\" id=\"imgtopic6\"\n    style=\"cursor:pointer;\" onclick=\"slide_topic6.slideIt();\" border=\"0\">\n  <strong>H-Predictor</strong>\n  <div id=\"divtopic6\" style=\"margin: 5px; padding: 5px 10px; border: 1px solid rgb(187, 187, 187); display: block; overflow: hidden;\">\n    <div>\n      <p><a href=\"https://dokhlab.med.psu.edu/hpredictor/index.php/Special:Hpredictor\"\n          target=\"_blank\"><img style=\"border: 1px dotted #AAAAAA; padding: 3px 3px 3px 3px;\"\n            src=\"http://jianopt.com/dokhlab/actions/image.php?name=hpredictor.jpg\"\n            width=\"225\" height=\"150\" align=\"right\"></a>Hinge\n        region predictor (H-Predictor) predicts putative hinge regions involved\n        in protein oligomerization via the domain-swapping mechanism. Domain\n        swapping is an important mechanism for protein oligomerization, in\n        which a fragment of a protein exchanges with a corresponding fragment\n        of another like protein. The segment of polypeptide chain that links\n        the swapped domain and the main protein is the hinge region. In most\n        experimentally observed domain-swapped oligomers, the swapped domains\n        correspond to one or several secondary structural elements from either\n        the N- or C-termini. Only in some rare instances the swapped domains\n        are positioned in the middle of the protein. The domain-swapped\n        oligomeric structures are, therefore, mainly determined by the location\n        and the properties of the hinge region.</p>\n      <p>Using a simple contact-based potential for enthalpy and graph theory-\n        based estimation for entropy, H-Predictor quantifies for each residue\n        the propensity as the hinge region. Physically, the H-Predictor\n        computes for each residue the effective temperature to populate an\n        \"intermediate\" state, where the protein unfolds around this residue\n        into two sub-domains each of which maintains their native-like\n        structure. Thus, the smaller the effective temperature, the higher the\n        probability for a residue to be in the hinge-region. The proposed\n        predictor is not a measure of the protein\"s propensity for\n        domain-swapping, but rather a structural propensity that a hinge region\n        may result in domain swapping. Additionally, if the protein features\n        folding intermediate, the H-Predictor can also provide hint to the\n        weakest regions that unfold prior to the compete unfolding.</p>\n      <p>For details of the method, please refer to the paper: F. Ding, K. C.\n        Prutzman, S. L. Campbell, and N. V. Dokholyan, Structure, 14: 5-14\n        (2006)</p>\n    </div>\n  </div>\n\n  <img src=\"http://jianopt.com/dokhlab/actions/image.php?name=collapse.gif\" id=\"imgtopic7\"\n    style=\"cursor:pointer;\" onclick=\"slide_topic7.slideIt();\" border=\"0\">\n  <strong>UniRapR</strong>\n  <div id=\"divtopic7\" style=\"margin: 5px; padding: 5px 10px; border: 1px solid rgb(187, 187, 187); display: block; overflow: hidden;\">\n    <div>\n      <p><a target=\"_blank\"><img style=\"border: 1px dotted #AAAAAA; padding: 3px 3px 3px 3px;\"\n            src=\"http://jianopt.com/dokhlab/actions/image.php?name=uniRapR.jpg\"\n            width=\"225\" height=\"150\" align=\"right\"></a>For\n        many critical cellular behaviors, cell signaling is precisely\n        controlled in seconds at submicron level. Testing hypotheses about such\n        a rapid spatiotemporal dynamics in intact living cells demands robust,\n        rapid and generic tools that allow controlling activity at\n        posttranscriptional level. UniRapR (unimolecular rapamycin-regulated)\n        protein was designed for this purpose and it acts as a protein switch\n        controlled by binding of small molecule rapamycin. Insertion of uniRapR\n        domain into the vicinity of active sites renders host proteins\n        inactive, and addition of rapamycin or its analogues into the cell\n        medium reactivates the host protein in minutes. By this way, the\n        function of the host protein can be easily investigated at either\n        single cell or whole organism level.</p>\n      <p>For details of the method, please refer to the paper: O. Dagliyan, D.\n        Shirvanyants, A. V. Karginov, F. Ding, L. Fee, S. N. Chandrasekaran, C.\n        M. Freisinger, G. A. Smolen, A. Huttenlocher, K. M. Hahn, N. V.\n        Dokholyan \"Rational design of a ligand-controlled protein\n        conformational switch\" Proc Natl Acad Sci U S A,110:6800-4 (2013) </p>\n      <p>The DNA construct is available at <a href=\"https://www.addgene.org/45381\">\n          Addgene</a>. </p>\n    </div>\n  </div>\n\n\n</div>","edit":"https://docs.google.com/document/d/1EEsZLkurRwiMT97u_spdPxToz_Nm8mJquQa75YcX-LQ/edit?usp=sharing"},"carousel":["dg2010S.jpg","SPELL-news.png"],"timeline":{"src":"https://docs.google.com/spreadsheets/d/1i4uUGsHwLONOTcsOGFApWs0KILqpSN8HHzMX4XRe8wU/edit#gid=1643108082","width":"1200","height":"600","weight":"600"}}